In [1]:
import pandas as pd
import numpy as np

url = (
   "https://raw.github.com/pandas-dev"
   "/pandas/master/pandas/tests/io/data/csv/tips.csv")

In [2]:
tips = pd.read_csv()

In [3]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [4]:
tips[["total_bill","tip","smoker","time"]].head(5)

   total_bill   tip smoker    time
0       16.99  1.01     No  Dinner
1       10.34  1.66     No  Dinner
2       21.01  3.50     No  Dinner
3       23.68  3.31     No  Dinner
4       24.59  3.61     No  Dinner

In [5]:
tips.assign(tip_rate = tips["tip"] / tips["total_bill"]).head(5)

   total_bill   tip     sex smoker  day    time  size  tip_rate
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [6]:
tips[tips["time"] == "Dinner"].head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [7]:
is_dinner = tips["time"] == "Dinner"

In [8]:
is_dinner.value_counts()

True     176
False     68
Name: time, dtype: int64

In [9]:
tips[is_dinner].head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [10]:
# tips of more than $5.00 at Dinner meals
tips[(tips["time"] == "Dinner") & (tips["tip"] > 5.00)]

     total_bill    tip     sex smoker  day    time  size
23        39.42   7.58    Male     No  Sat  Dinner     4
44        30.40   5.60    Male     No  Sun  Dinner     4
47        32.40   6.00    Male     No  Sun  Dinner     4
52        34.81   5.20  Female     No  Sun  Dinner     4
59        48.27   6.73    Male     No  Sat  Dinner     4
116       29.93   5.07    Male     No  Sun  Dinner     4
155       29.85   5.14  Female     No  Sun  Dinner     5
170       50.81  10.00    Male    Yes  Sat  Dinner     3
172        7.25   5.15    Male    Yes  Sun  Dinner     2
181       23.33   5.65    Male    Yes  Sun  Dinner     2
183       23.17   6.50    Male    Yes  Sun  Dinner     4
211       25.89   5.16    Male    Yes  Sat  Dinner     4
212       48.33   9.00    Male     No  Sat  Dinner     4
214       28.17   6.50  Female    Yes  Sat  Dinner     3
239       29.03   5.92    Male     No  Sat  Dinner     3

In [11]:
# tips by parties of at least 5 diners OR bill total was more than $45
tips[(tips["size"] >= 5) | (tips["total_bill"] > 45)]

     total_bill    tip     sex smoker   day    time  size
59        48.27   6.73    Male     No   Sat  Dinner     4
125       29.80   4.20  Female     No  Thur   Lunch     6
141       34.30   6.70    Male     No  Thur   Lunch     6
142       41.19   5.00    Male     No  Thur   Lunch     5
143       27.05   5.00  Female     No  Thur   Lunch     6
155       29.85   5.14  Female     No   Sun  Dinner     5
156       48.17   5.00    Male     No   Sun  Dinner     6
170       50.81  10.00    Male    Yes   Sat  Dinner     3
182       45.35   3.50    Male    Yes   Sun  Dinner     3
185       20.69   5.00    Male     No   Sun  Dinner     5
187       30.46   2.00    Male    Yes   Sun  Dinner     5
212       48.33   9.00    Male     No   Sat  Dinner     4
216       28.15   3.00    Male    Yes   Sat  Dinner     5

In [12]:
frame = pd.DataFrame(
 {"col1": ["A", "B", np.NaN, "C", "D"], "col2": ["F", np.NaN, "G", "H", "I"]})

In [13]:
frame.notna()

    col1   col2
0   True   True
1   True  False
2  False   True
3   True   True
4   True   True

In [14]:
# the records where col2 in the frame table is NULL
frame[frame["col2"].isna()]

  col1 col2
1    B  NaN

In [15]:
frame[frame["col1"].notna()]

  col1 col2
0    A    F
1    B  NaN
3    C    H
4    D    I

## Group by

In [16]:
# pandas use size() to group by compared with the GROUP BY in sql
tips.groupby("sex").size()

sex
Female     87
Male      157
dtype: int64

In [17]:
# rather than the count() method, since it applies the function to each column
tips.groupby("sex").count()

        total_bill  tip  smoker  day  time  size
sex
Female          87   87      87   87    87    87
Male           157  157     157  157   157   157

In [19]:
tips.groupby("sex")["total_bill"]

In [22]:
tips.groupby("sex")

In [18]:
tips.groupby("sex")["total_bill"].count()

sex
Female     87
Male      157
Name: total_bill, dtype: int64

In [24]:
tips.groupby("day").agg({"tip": np.mean, "day": np.size})

           tip  day
day
Fri   2.734737   19
Sat   2.993103   87
Sun   3.255132   76
Thur  2.771452   62

In [32]:
# Grouping by more than one column 
tips.groupby(["smoker","day"]).agg({"tip": [np.size, np.mean]})

              tip
             size      mean
smoker day
No     Fri    4.0  2.812500
       Sat   45.0  3.102889
       Sun   57.0  3.167895
       Thur  45.0  2.673778
Yes    Fri   15.0  2.714000
       Sat   42.0  2.875476
       Sun   19.0  3.516842
       Thur  17.0  3.030000

In [37]:
# Join
df1 = pd.DataFrame({"key": ["A", "B", "C", "D"], "value":np.random.randn(4)})
df2 = pd.DataFrame({"key": ["B", "D", "D", "E"], "value":np.random.randn(4)})

In [38]:
# Merge in python while join in sql
# merge performs an INNER JOIN by default
pd.merge(df1, df2, on = "key")

  key   value_x   value_y
0   B -0.196204 -0.604784
1   D  0.392081  1.645435
2   D  0.392081 -1.260964

In [39]:
indexed_df2 = df2.set_index("key")

In [40]:
pd.merge(df1, indexed_df2, left_on="key", right_index= True)

  key   value_x   value_y
1   B -0.196204 -0.604784
3   D  0.392081  1.645435
3   D  0.392081 -1.260964

In [41]:
#  show all records from df1
pd.merge(df1, df2, on = "key", how = "left")

  key   value_x   value_y
0   A  0.987707       NaN
1   B -0.196204 -0.604784
2   C  0.455272       NaN
3   D  0.392081  1.645435
4   D  0.392081 -1.260964

In [42]:
# show all record from df2
pd.merge(df1, df2, on="key", how = "right")

  key   value_x   value_y
0   B -0.196204 -0.604784
1   D  0.392081  1.645435
2   D  0.392081 -1.260964
3   E       NaN  0.399323

## Full join

In [43]:
#  show all records from both frames
pd.merge(df1, df2, on= "key", how = "outer")

  key   value_x   value_y
0   A  0.987707       NaN
1   B -0.196204 -0.604784
2   C  0.455272       NaN
3   D  0.392081  1.645435
4   D  0.392081 -1.260964
5   E       NaN  0.399323

## UNION

In [45]:
df1 = pd.DataFrame(
   ....:     {"city": ["Chicago", "San Francisco", "New York City"], "rank": range(1, 4)}
   ....: )
   ....: 
df2 = pd.DataFrame(
   ....:     {"city": ["Chicago", "Boston", "Los Angeles"], "rank": [1, 4, 5]}
   ....: )
   ....:

In [46]:
pd.concat([df1,df2])

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
0        Chicago     1
1         Boston     4
2    Los Angeles     5

In [47]:
pd.concat([df1, df2]).drop_duplicates()

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
1         Boston     4
2    Los Angeles     5

## pandas equivalents for some SQL analytic and aggregate functions

In [48]:
# Top n rows with offset
tips.nlargest(10 + 5, columns = "tip").tail(10)

     total_bill   tip     sex smoker   day    time  size
183       23.17  6.50    Male    Yes   Sun  Dinner     4
214       28.17  6.50  Female    Yes   Sat  Dinner     3
47        32.40  6.00    Male     No   Sun  Dinner     4
239       29.03  5.92    Male     No   Sat  Dinner     3
88        24.71  5.85    Male     No  Thur   Lunch     2
181       23.33  5.65    Male    Yes   Sun  Dinner     2
44        30.40  5.60    Male     No   Sun  Dinner     4
52        34.81  5.20  Female     No   Sun  Dinner     4
85        34.83  5.17  Female     No  Thur   Lunch     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4

In [50]:
#  top n rows per group
( 
    tips.assign(
        rn = tips.sort_values(["total_bill"], ascending= False)
        .groupby(["day"])
        .cumcount()
        +1
    )
    .query("rn < 3")
    .sort_values(["day","rn"])
)

     total_bill    tip     sex smoker   day    time  size  rn
95        40.17   4.73    Male    Yes   Fri  Dinner     4   1
90        28.97   3.00    Male    Yes   Fri  Dinner     2   2
170       50.81  10.00    Male    Yes   Sat  Dinner     3   1
212       48.33   9.00    Male     No   Sat  Dinner     4   2
156       48.17   5.00    Male     No   Sun  Dinner     6   1
182       45.35   3.50    Male    Yes   Sun  Dinner     3   2
197       43.11   5.00  Female    Yes  Thur   Lunch     4   1
142       41.19   5.00    Male     No  Thur   Lunch     5   2

In [55]:
(
    tips.assign(
        rnk = tips.groupby(["day"])["total_bill"].rank(method = "first",ascending = False)
    )
.query("rnk < 3")
.sort_values(["day",'rnk'])
)

     total_bill    tip     sex smoker   day    time  size  rnk
95        40.17   4.73    Male    Yes   Fri  Dinner     4  1.0
90        28.97   3.00    Male    Yes   Fri  Dinner     2  2.0
170       50.81  10.00    Male    Yes   Sat  Dinner     3  1.0
212       48.33   9.00    Male     No   Sat  Dinner     4  2.0
156       48.17   5.00    Male     No   Sun  Dinner     6  1.0
182       45.35   3.50    Male    Yes   Sun  Dinner     3  2.0
197       43.11   5.00  Female    Yes  Thur   Lunch     4  1.0
142       41.19   5.00    Male     No  Thur   Lunch     5  2.0

In [58]:
(
   tips[tips["tip"] < 2]
   .assign(rnk_min=tips.groupby(["sex"])["tip"].rank(method="min"))
   .query("rnk_min < 3")
   .sort_values(["sex", "rnk_min"]))

     total_bill   tip     sex smoker  day    time  size  rnk_min
67         3.07  1.00  Female    Yes  Sat  Dinner     1      1.0
92         5.75  1.00  Female    Yes  Fri  Dinner     2      1.0
111        7.25  1.00  Female     No  Sat  Dinner     1      1.0
236       12.60  1.00    Male    Yes  Sat  Dinner     2      1.0
237       32.83  1.17    Male    Yes  Sat  Dinner     2      2.0

## UPDATE

In [59]:
tips.loc[tips["tip"] < 2, "tip"] *= 2

## DELETE

In [60]:
# select the rows that should remain, instead of deleting them
tips = tips.loc[tips["tip"] <= 9]

## Grouping

In [61]:
# totaol grouping processing in python
# 
# 
#

In [62]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],'B': ['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],'C': np.random.randn(8), 'D': np.random.randn(8)})

In [63]:
df

     A      B         C         D
0  foo    one  0.970155 -1.108720
1  bar    one  0.871714 -0.463697
2  foo    two  1.376256 -2.119303
3  bar  three -2.459161  1.585878
4  foo    two  0.074966  0.216332
5  bar    two  0.172399 -2.609185
6  foo    one -0.717667  1.302368
7  foo  three  0.330487 -0.286038

In [65]:
df.groupby('A').sum()

            C         D
A
bar -1.415048 -1.487003
foo  2.034198 -1.995360

In [66]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.871714 -0.463697
    three -2.459161  1.585878
    two    0.172399 -2.609185
foo one    0.252488  0.193648
    three  0.330487 -0.286038
    two    1.451222 -1.902970

## Reshaping

In [71]:
## Stack
tuples = list(zip(*[['bar','bar','baz','baz','foo', 'foo', 'qux', 'qux'],['one', 'two', 'one', 'two','one', 'two', 'one', 'two']]))

In [73]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [74]:
index = pd.MultiIndex.from_tuples(tuples, names = ['first','second'])

In [75]:
df = pd.DataFrame(np.random.randn(8, 2), index = index, columns=['A','B'])

df2 = df[:4]
df2

                     A         B
first second
bar   one     1.263344 -1.680375
      two     1.143709 -1.098075
baz   one     1.934808  0.059637
      two     1.220408 -1.220202

In [76]:
# stack each record from different columns into a whole column including all rows
stacked = df2.stack()
stacked

first  second
bar    one     A    1.263344
               B   -1.680375
       two     A    1.143709
               B   -1.098075
baz    one     A    1.934808
               B    0.059637
       two     A    1.220408
               B   -1.220202
dtype: float64

In [77]:
# like spread the series out
stacked.unstack()

                     A         B
first second
bar   one     1.263344 -1.680375
      two     1.143709 -1.098075
baz   one     1.934808  0.059637
      two     1.220408 -1.220202

In [78]:
stacked.unstack(1)

second        one       two
first
bar   A  1.263344  1.143709
      B -1.680375 -1.098075
baz   A  1.934808  1.220408
      B  0.059637 -1.220202